sources/part_03/advanced_foil/foil_gmsh_mesh/icoFoam/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// *** Air @ 20C ***
rho             [1 -3 0 0 0 0 0] 1.2;
nu              [0 2 -1 0 0 0 0] 1.5e-05; // kinematic viscosity

// *** Water @ 20C***
//rho             [1 -3 0 0 0 0 0] 1000;
//nu              [0 2 -1 0 0 0 0] 1e-06; // kinematic viscosity

// ************************************************************************* //
